app/controllers/cocktails_controller.rb

    def index
        @cocktails = Cocktail.all
---
SELECT `cocktails`.* FROM `cocktails`

    def show
        @cocktail = Cocktail.find(params[:id])
        @drinks = @cocktail.drinks
        @helper = DrinksCocktail.where cocktail_id: @cocktail.id
        @info = {}
        @drinks.each do |drink|
            aux = @helper.where drink_id: drink.id
---
SELECT `cocktails`.* FROM `cocktails` WHERE `cocktails`.`id` = 50 LIMIT 1
SELECT `drinks`.* FROM `drinks` INNER JOIN `drinks_cocktails` ON `drinks`.`id` = `drinks_cocktails`.`drink_id` WHERE `drinks_cocktails`.`cocktail_id` = 50
SELECT `drinks_cocktails`.* FROM `drinks_cocktails` WHERE `drinks_cocktails`.`cocktail_id` = 50 LIMIT 1
SELECT `drinks_cocktails`.* FROM `drinks_cocktails` WHERE `drinks_cocktails`.`cocktail_id` = 50 AND `drinks_cocktails`.`drink_id` = 84

    def create
        @cocktail = Cocktail.new(cocktail_params)
        if @cocktail.save
---
INSERT INTO `cocktails` (`name`, `created_at`, `updated_at`) VALUES ('dfdgh', '2023-04-06 15:01:56.414954', '2023-04-06 15:01:56.414954')

        def set_cocktail
            @cocktail = Cocktail.find(params[:id])
---
SELECT `cocktails`.* FROM `cocktails` WHERE `cocktails`.`id` = 50 LIMIT 1