app/controllers/drinks_controller.rb

SELECT `drinks`.* FROM `drinks`
---
    def index
        @drinks = Drink.all

SELECT `drinks`.* FROM `drinks` WHERE `drinks`.`id` = NULL LIMIT 1
---
    def show
        @drink = Drink.find(params[:id])

INSERT INTO `drinks` (`name`, `quantity`, `created_at`, `updated_at`) VALUES ('Safari', 12, '2023-04-05 13:18:35.968307', '2023-04-05 13:18:35.968307')
---
    def create
        @drink = Drink.new(drink_params)
        if @drink.save

SELECT `drinks`.* FROM `drinks` WHERE `drinks`.`id` = 87 LIMIT 1
DELETE FROM `drinks` WHERE `drinks`.`id` = 87
---
    def destroy
        @drink = Drink.find(params[:id])
        @drink.destroy

SELECT `drinks`.* FROM `drinks` WHERE `drinks`.`id` = 1 LIMIT 1
UPDATE `drinks` SET `drinks`.`quantity` = 9, `drinks`.`updated_at` = '2023-04-05 10:27:11.202483' WHERE `drinks`.`id` = 1
---
    def update
        @drink = Drink.find(params[:id])
        if @drink.update_Attributes(drink_params)